# Class 05: Pandas Tips
Written by: Shafique Ahmad \
Date: 10/21/2023 \
Contact me on: \
[Github](https://github.com/shafiq-ahmad/) \
[Github](https://github.com/webapplics/) \
[LinkedIn](https://www.linkedin.com/in/shafique-ahmad-b0865361)

Import Libraries

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

Load Dataset

In [4]:
df = sns.load_dataset("titanic")

Missing values. percentage

In [5]:
df.isnull().sum() / len(df) *100

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

## drop a collumn

As for rule of `missing data`

If too much missing value remove them mostly (if more than 50% and field isn't important)

So `deck` column has 77% so remove it as below

In [6]:
df.drop('deck',axis=1, inplace=True)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

Filling missing value by mean of age. where percent is 19

In [7]:
df['age'].fillna(df['age'].mean(), inplace=True)
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

## Binning

Data of one column need to divide in groups like the `age` column in the following

In [8]:
bins = [0,1,5,12,18,30,50,80]
labels =['Infants', 'Toddlers', 'Kids', 'Teens', 'Youngs', 'Middle Age', 'Old']
pd.cut(df['age'], bins=bins, labels=labels)

0          Youngs
1      Middle Age
2          Youngs
3      Middle Age
4      Middle Age
          ...
886        Youngs
887        Youngs
888        Youngs
889        Youngs
890    Middle Age
Name: age, Length: 891, dtype: category
Categories (7, object): ['Infants' < 'Toddlers' < 'Kids' < 'Teens' < 'Youngs' < 'Middle Age' < 'Old']

### Feature engineer or creating new column

In [9]:
bins = [0,1,5,12,18,30,50,80]
labels =['Infants', 'Toddlers', 'Kids', 'Teens', 'Youngs', 'Middle Age', 'Old']
df['binned_age'] = pd.cut(df['age'], bins=bins, labels=labels)

df['binned_age'].value_counts()

binned_age
Youngs        447
Middle Age    241
Teens          70
Old            64
Toddlers       30
Kids           25
Infants        14
Name: count, dtype: int64

### Rename column

In [10]:
df.rename(columns={'binned_age': 'age_group'}, inplace=True)

# hypothisis or idea of things

## Data Filteration

Filter Columns

In [11]:
df_01 = df[['survived','age_group','fare', 'class']]
df_01.head()

   survived   age_group     fare  class
0         0      Youngs   7.2500  Third
1         1  Middle Age  71.2833  First
2         1      Youngs   7.9250  Third
3         1  Middle Age  53.1000  First
4         0  Middle Age   8.0500  Third

Filter rows on rows criteria

The following we created a new dataset containing only 'First' class

In [12]:
df_first = df_01[df_01['class'] == 'First']
df_first.head()

    survived   age_group     fare  class
1          1  Middle Age  71.2833  First
3          1  Middle Age  53.1000  First
6          0         Old  51.8625  First
11         1         Old  26.5500  First
23         1      Youngs  35.5000  First

### Based on our bins check who servive in those group based on age and fare

In [13]:
df.loc[df['survived'] == 1].groupby('age_group').size()

C:\Users\Shafiq\AppData\Local\Temp\ipykernel_8204\3902602629.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.loc[df['survived'] == 1].groupby('age_group').size()

age_group
Infants        12
Toddlers       19
Kids            9
Teens          30
Youngs        148
Middle Age    102
Old            22
dtype: int64

In [14]:
df.loc[df['survived'] == 1].groupby('age_group')['survived'].value_counts()

C:\Users\Shafiq\AppData\Local\Temp\ipykernel_8204\2775767463.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.loc[df['survived'] == 1].groupby('age_group')['survived'].value_counts()

age_group   survived
Infants     1            12
Toddlers    1            19
Kids        1             9
Teens       1            30
Youngs      1           148
Middle Age  1           102
Old         1            22
Name: count, dtype: int64